Data = {
  "shake":  [
    {
      "name": "黑",
      "noun": "巧克力,醬油,墨汁,可樂,黑豆漿,青草茶,咖啡,巧克力牛奶,保力達蠻牛,工業廢水,海燕窩"
    },
    {
      "name": "白",
      "noun": "鮮奶泡,豆漿,糨糊,牛奶,濃稠豆漿,薏仁湯,優格,精華液"
    },
    {
      "name": "藍",
      "noun": "海水,原子筆水,史萊姆汁,眼淚,異形血,硫酸銅"
    },
    {
      "name": "紅",
      "noun": "番茄汁,蘋果汁,鼻血,草莓聖代,血腥瑪麗,感冒糖漿"
    },
    {
      "name": "黃",
      "noun": "花生醬,芥末醬,柳橙汁,橘子汁,香蕉聖代,芬達,蛋液,鳳梨汁,茶湯,金坷垃"
    },
    {
      "name": "綠",
      "noun": "星巴克,甘蔗,苜蓿芽,芭樂汁,檸檬水,嘔吐物,蔬菜湯,青茶,膽汁,綠色鼻涕"
    },
    {
      "name": "小明",
      "noun": "魯蛇,強者我朋友,@躺著也中槍 阿阿阿阿 阿阿阿阿 會不會死掉掉",
      "adj": "衰衰,痛失雙腿又被車撞"
    },
    {
      "name": "小三",
      "noun": "犀利人妻,小三,綠皮卡,@隔壁老王是我客兄,@三十如狼，四十如虎，五十坐地能吸土,@原來SOD都是真的,@讓她生讓她生!",
      "adj": "慘綠,捉姦在床,老牛吃嫩草,無縫接軌"
    },
    {
      "name": "草帽",
      "noun": "魯夫,阿土伯,草帽",
      "adj": "熱帶風情,純手工製作,伸縮自如富有彈性,我要成為海賊王"
    },
    {
      "name": "手裡劍",
      "noun": "火影,忍者哈特利,日本,手裡劍",
      "adj": "尖銳,被偷襲,中二,超展開"
    },
    {
      "name": "內褲",
      "noun": "超人,蠟筆小新,AV女優,廁所,內褲,@原味內褲哩金變態,@道歉時露出胸部是常識,@原來SOD都是真的",
      "adj": "情色,腥臭泛黃,惡臭泛黃,戴著內褲,開高衩"
    },
    {
      "name": "貓",
      "noun": "Hello Kitty,鞋貓劍客,日本,肉球",
      "adj": "傲驕任性,可愛邪惡,賣萌"
    },
    {
      "name": "麥當勞叔叔",
      "noun": "薯條,漢堡,怪叔叔,藍藍路,小丑,甲甲",
      "adj": "炸到噴油,重鹹,邪惡,歡樂,洗腦"
    },
    {
      "name": "肯德基爺爺",
      "noun": "炸雞,蛋塔,烤雞,馬路三寶,老練棒棒",
      "adj": "好吃,基情,炸到噴油,鬆鬆脆脆"
    },
    {
      "name": "雞排",
      "noun": "豪大,鄉民,雞排,雞排妹,照燒,@雞排要切不要辣,@萬人響應，一人到場",
      "adj": "好吃,油膩,鬆鬆脆脆,噴油"
    },
    {
      "name": "珍珠",
      "noun": "珍珠,50嵐,奶茶,黑糖,美人魚",
      "adj": "QQ,飽滿渾圓,有顆粒,煮不熟"
    },
    {
      "name": "榴槤",
      "noun": "榴槤,泰國,人妖,熱帶",
      "adj": "硬邦邦,帶刺,臭哄哄"
    },
    {
      "name": "芭樂",
      "noun": "芭樂,大社,手榴彈,@阿姆斯特朗旋風噴射阿姆斯特朗砲,洋腸",
      "adj": "有籽,卡牙,硬硬"
    },
    {
      "name": "香蕉",
      "noun": "香蕉船,東京芭娜娜,香蕉,熱帶",
      "adj": "彎曲,軟嫩,長長,帶皮,GGININ"
    },
    {
      "name": "30公分的尺",
      "noun": "鄉民,@今天的我 沒有極限,@糟了，是世界奇觀,@鄉民都30cm起跳der",
      "adj": "長長,無敵長,GGININ"
    },
    {
      "name": "棒球",
      "noun": "強肩犯",
      "adj": "安打安打全壘打,陽春,一飛沖天"
    },
    {
      "name": "紅茶",
      "noun": "淡定哥,午後",
      "adj": "ˊ_>ˋ,洗腦,放鬆,淡定"
    },
    {
      "name": "草莓",
      "noun": "草莓,果醬,蛋糕,7年級",
      "adj": "凹凸不平,粉刺滿佈,酸酸甜甜,月球表面"
    },
    {
      "name": "蜘蛛",
      "noun": "蜘蛛人,電影,叢林,八腳異型",
      "adj": "長毛,會動,兇殘"
    },
    {
      "name": "壁虎",
      "noun": "鄉下,蚊子剋星,木守宮",
      "adj": "會動,軟嫩,飛天遁地"
    },
    {
      "name": "聖誕老公公",
      "noun": "襪子,麋鹿,雪橇,鬍子,乖小孩,雪山",
      "adj": "肥滿,大肚腩,慈祥,老邁,酒駕,臉紅"
    },
    {
      "name": "紅包",
      "noun": "小屁孩,紅明顯,@公道價8萬1,@好了！下去領五百塊,@壞了50收",
      "adj": "散財,地上的東西部要亂撿,阿不就好棒棒"
    },
    {
      "name": "蟑螂",
      "noun": "蟑螂,垃圾,廚餘,小強,呂小布,活化石",
      "adj": "噁心,骯髒,黑心,胎哥"
    },
    {
      "name": "牛奶",
      "noun": "牛奶,林鳳營,克寧,乳糖不耐症,幹拎杯骨科大,熊族",
      "adj": "高挑,雄壯,像大樹一樣,撞豆腐自殺"
    },
    {
      "name": "惡魔果實",
      "noun": "海賊王,尾田,橡皮,旱鴨子",
      "adj": "怕水,強大,OP,開外掛"
    },
    {
      "name": "橡皮筋",
      "noun": "橡皮筋,小屁孩,比賽",
      "adj": "軟Q,彈性,疲乏,斷裂"
    },
    {
      "name": "吸管",
      "noun": "造型吸管,粗吸管",
      "adj": "中空,實用,細細長長,自以為氣管"
    },
    {
      "name": "咖啡",
      "noun": "星巴克,伯朗,藍山,曼特寧,整個城市都是我的化工廠",
      "adj": "提神,文青,氣氛,失眠,胃痛,脹氣"
    },
    {
      "name": "保險套",
      "noun": "小雨傘,避孕,@你好糟糕，請暫時不要跟我說話。",
      "adj": "滑溜溜,安全,各種口味,令人讚嘆"
    },
    {
      "name": "衛生棉",
      "noun": "蘇菲,好自在,大姨媽,MC,MC美江,@這種要求我還是第一次聽到",
      "adj": "有翅膀,好吸收,防漏側邊,霸氣側漏"
    },
    {
      "name": "板凳",
      "noun": "板凳,木製,必須死,@正常能量釋放",
      "adj": "便攜,輕巧,低矮,兇猛,戶外,古早"
    },
    {
      "name": "電線",
      "noun": "中華電信,電話線,網路線,高壓電,皮卡丘,@內線就交給趙建銘！",
      "adj": "危險,怕水,小心,一失足成千古恨,滋滋作響"
    },
    {
      "name": "牙籤",
      "noun": "衛生禮儀,木製,奈米",
      "adj": "尖尖細細又刺刺,聖人模式"
    },
    {
      "name": "阿G師",
      "noun": "國際禮儀,@嘴對嘴還好啦，經常遇到這種經驗,@不是外遇喔 是 「巧遇」",
      "adj": "小當家真心推薦,異性緣非常好,很踏實,關懷、包容、協助"
    },
    {
      "name": "豬腳",
      "noun": "萬巒,屏東,聞腋青年,@人家都上太空了，我們還在殺豬公！,@人家都上空了，我們還在殺豬公！",
      "adj": "Q彈,富含角質,滋潤,做臉,毛毛"
    },
    {
      "name": "鑽石",
      "noun": "美江,南非,美江,MC美江,@不對啊今年不是五倍嗎?,寶劍,網羅",
      "adj": "荒謬,信耶穌得永生,昂貴,今年五倍,堅硬,阿不就好棒棒,燒毀"
    },
    {
      "name": "蘋果",
      "noun": "蘋果麵包,白雪公主,華盛頓,賈伯斯,@一天一蘋果，醫生遠離我",
      "adj": "女生必備,清脆爽口,甜美,有毒"
    },
    {
      "name": "泡麵",
      "noun": "康師傅,防腐劑,黑心統二",
      "adj": "方便,簡單,傷身,好吃,便捷"
    },
    {
      "name": "芥末",
      "noun": "生魚片,阿里山,山葵,芥末,世界末日",
      "adj": "火辣,超嗆,日本"
    },
    {
      "name": "肉燥",
      "noun": "阿嬤,肉燥,豬肉",
      "adj": "香味四溢,油膩,軟爛,下飯,鹹濕,家鄉味,古早"
    },
    {
      "name": "Nokia 3310",
      "noun": "不死機神,PTT三大神器之一,@糟了，是世界奇觀,@再戰十年,@給我一隻3310，我就能舉起地球。",
      "adj": "外星科技,女媧補天,開天闢地"
    },
    {
      "name": "美工刀",
      "noun": "巨人,美宣,書局,必須死,@色字頭上一把刀,@色字頭上九把刀,@李組長眉頭一皺，發覺案情並不單純",
      "adj": "變身,流血,危險,拆封,身高一米六"
    },
    {
      "name": "氮氣",
      "noun": "跑跑卡丁車,跑車,競賽,塊陶",
      "adj": "加速,OP,神速,旋風衝鋒龍捲風"
    },
    {
      "name": "眼鏡",
      "noun": "新八,本體,徐志摩,盧廣仲,文青,文藝青年,@孩子的學習不能等,夢幻眼鏡OL,眼鏡娘",
      "adj": "超厚,有裝飾,治近視,老花"
    },
    {
      "name": "可樂",
      "noun": "旅行社,Coca-Cola,米國",
      "adj": "噴濺,刺激.甜甜,傷胃,洗胃,穿腸破肚"
    },
    {
      "name": "大同電鍋",
      "noun": "廚具,PTT三大神器,@再戰十年",
      "adj": "傳說中,小當家真心推薦"
    },
    {
      "name": "檸檬",
      "noun": "青春,清玉,飲料,酸民",
      "adj": "酸V,健康,黃金比例"
    },
    {
      "name": "肉桂",
      "noun": "蘋果派,肉桂",
      "adj": "西式,濃郁,灼熱,西洋"
    },
    {
      "name": "香草",
      "noun": "冰淇淋,7-11,全家,IKEA,搶頭香",
      "adj": "基本,香甜,冰涼,甜膩"
    },
    {
      "name": "輪子",
      "noun": "三輪車,四驅車,拿破崙",
      "adj": "黝黑,堅硬,有保養,黑亮黑亮,破舊"
    },
    {
      "name": "大便",
      "noun": "丁小雨,屎伯,蛆蛆,讓蛆蛆崩潰",
      "adj": "臭氣沖天,軟爛,黝黑"
    },
    {
      "name": "麵包",
      "noun": "法國麵包,大蒜,法國,麵包,太陽之手,酵母菌",
      "adj": "臭酸,硬邦邦,烤焦,鬆軟,有嚼勁"
    },
    {
      "name": "斗篷",
      "noun": "哈利波特,吸血鬼,超人,法師,哈利波特,尊爵不凡榮耀",
      "adj": "帥氣,飄飄然,神祕,隱形"
    },
    {
      "name": "糖",
      "noun": "蜜糖吐司,砂糖,螞蟻",
      "adj": "甜美,細緻,搗蛋"
    },
    {
      "name": "巧克力",
      "noun": "德芙,情人節,可可,巧克力工廠,巧克男孩",
      "adj": "苦澀,甘甜,熱情如火,情意,浪漫"
    },
    {
      "name": "衛生紙",
      "noun": "風情,舒潔,拉拉,大便,金百利,拉拉,@洋蔥文、加了洋蔥",
      "adj": "必備,柔軟,白淨,地方的鄉民需要"
    },
    {
      "name": "素肚",
      "noun": "素肚,甲甲,DIY,@華生你突破盲腸了",
      "adj": "地方的鄉民需要,正常能量釋放"
    },
    {
      "name": "馬",
      "noun": "馬皇,水母腦,689,死亡之握,天龍人,@我們也是受害者,@為甚麼要放棄治療,@得罪了方丈還想逃",
      "adj": "快樂夥伴,秀下限,虛心傾聽、徹底檢討、積極改進"
    },
    {
      "name": "婉君",
      "noun": "婉君,689,@好了！下去領五百塊,@我們也是受害者,@都是they的錯,@你媽知道你在這裡玩廢遊戲嗎？",
      "adj": "快樂夥伴"
    },
    {
      "name": "蛋",
      "noun": "好色龍蛋蛋,小雞嗶嗶,行政院,立法院",
      "adj": "淡淡哀傷,臭酸"
    },
    {
      "name": "味噌",
      "noun": "@那就是排骨酥湯阿幹!!",
      "adj": "日本鹹濕風味"
    }
  ],
  "special" :[
    {
      "name": "草帽+手裡劍",
      "drinkname": "海賊王與火影忍者的愛恨情仇特調$",
      "array": "8,9"
    },
    {
      "name": "草帽+惡魔果實",
      "drinkname": "日式抹茶海賊王特調$,我要成為海賊王",
      "array": "8,29"
    },
    {
      "name": "惡魔果實+橡皮筋",
      "drinkname": "日式抹茶海賊王特調$,我要成為海賊王",
      "array": "29,30"
    },
    {
      "name": "草帽+橡皮筋",
      "drinkname": "日式抹茶海賊王特調$,我要成為海賊王",
      "array": "8,30"
    },
    {
      "name": "草帽+斗篷",
      "drinkname": "阿公簑衣",
      "array": "8,57"
    },
    {
      "name": "草帽+豬腳",
      "drinkname": "橡膠橡膠印章$",
      "array": "8,39"
    },
    {
      "name": "雞排+斗篷",
      "drinkname": "雞排英雄特調",
      "array": "8,57"
    },
    {
      "name": "板凳+Nokia 3310",
      "drinkname": "@要你命三千,@奪命特調,@含笑三步顛,@大規模毀滅性武器",
      "array": "35,45"
    },
    {
      "name": "雞排+30公分的尺",
      "drinkname": "傳說中鄉民的30公分,@起床我都撞到頭",
      "array": "14,19"
    },
    {
      "name": "香蕉+30公分的尺",
      "drinkname": "傳說中鄉民的30公分,@起床我都撞到頭",
      "array": "18,19"
    },
    {
      "name": "草帽+可樂",
      "drinkname": "佛朗基動力,su~~per~~",
      "array": "8,49"
    },
    {
      "name": "惡魔果實+鑽石",
      "drinkname": "美江的誘惑",
      "array": "29,40"
    },
    {
      "name": "巧克力+大便",
      "drinkname": "傻傻分不清楚",
      "array": "59,55"
    },
    {
      "name": "保險套+衛生紙",
      "drinkname": "@想當初應該把你射在衛生紙上",
      "array": "33,60"
    },
    {
      "name": "衛生紙+香蕉",
      "drinkname": "@想當初應該把你射在衛生紙上",
      "array": "18,60"
    },
    {
      "name": "美工刀+氮氣",
      "drinkname": "砍巨人專用",
      "array": "46,47"
    },
    {
      "name": "珍珠+鑽石",
      "drinkname": "我是貴婦特調$",
      "array": "15,40"
    },
    {
      "name": "芥末+巧克力",
      "drinkname": "楊丞琳精選",
      "array": "43,59"
    },
    {
      "name": "吸管+珍珠",
      "drinkname": "嘴砲傳說$",
      "array": "15,31"
    },
    {
      "name": "眼鏡+咖啡",
      "drinkname": "村上村樹特調$,藤井樹特調$,夏日午後文青特調$",
      "array": "48,32"
    },
    {
      "name": "草莓+內褲",
      "drinkname": "@草莓百分百,草莓牛奶",
      "array": "22,10"
    },
    {
      "name": "氮氣+輪子",
      "drinkname": "@看不到我的車尾燈,最速傳說",
      "array": "47,54"
    },
    {
      "name": "檸檬+可樂",
      "drinkname": "@廁所清潔劑組",
      "array": "49,51"
    },
    {
      "name": "肉桂+香草",
      "drinkname": "歪果仁特調$,CCR$",
      "array": "52,53"
    },
    {
      "name": "牙籤+保險套",
      "drinkname": "@瘦骨如柴,@多此一舉",
      "array": "37,33"
    },
    {
      "name": "肉燥+板凳",
      "drinkname": "阿公的回憶特調$",
      "array": "35,44"
    },
    {
      "name": "小明+衛生紙",
      "drinkname": "單身特調$",
      "array": "6,60"
    },
    {
      "name": "香蕉+保險套",
      "drinkname": "告別單身特調$",
      "array": "18,33"
    },
    {
      "name": "檸檬+糖",
      "drinkname": "黃金比例",
      "array": "51,58"
    },
    {
      "name": "麥當勞叔叔+肯德基爺爺",
      "drinkname": "@速食盟主甄寰傳,命運的宿敵$",
      "array": "12,13"
    },
    {
      "name": "斗篷+麵包",
      "drinkname": "麵包超人",
      "array": "56,57"
    },
    {
      "name": "斗篷+內褲",
      "drinkname": "Superman",
      "array": "57,10"
    },
    {
      "name": "惡魔果實+惡魔果實",
      "drinkname": "@惡魔果實不能吃兩顆你不知道嗎?",
      "array": "29,29"
    }
  ]
}
